package stud.a4a.automatons;

public class Printer {
    // дана грамматика
    // нужен вывод заданной цепочки

    // мы получаем на вход некую грамматику
    // мы получаем на вход некую цепочку

    // вывести должны результат прохода по всей этой истории

    // есть алфавит
    // есть язык (который есть подмножество цепочек конечной длины из алфавита)

    // грамматика - способ построения языка из алфавита
    // правило - пара вида a -> b (a порождает b)

    // терминалы - константы (листья дерева разбора), нетерминалы - переменные (узлы дерева разбора)
    // терминалы справа, нетерминалы слева


}
